Revit 2022 API
IndependentTag.SetLeaderEnd Method
 Set the end position of the tag's leader that points to specified reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Syntax
C#
public void SetLeaderEnd(
	Reference referenceTagged,
	XYZ pntEnd
)
Visual Basic
Public Sub SetLeaderEnd ( _
	referenceTagged As Reference, _
	pntEnd As XYZ _
)
Visual C++
public:
void SetLeaderEnd(
	Reference^ referenceTagged,
	XYZ^ pntEnd
)
Parameters
referenceTagged
Type: Autodesk.Revit.DB.Reference
 The reference which is tagged.
pntEnd
Type: Autodesk.Revit.DB.XYZ
Remarks
 Tags with attached leaders or no leaders do not support leader ends. LeaderEndCondition for the tag's leader condition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The specified reference is not currently tagged.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no leader end because the tag does not use a free end leader.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace